; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=321, out_folder=./training, instance_id=67, seed=2091, goal_proportion=0.03

(define (problem blocksworld-67)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 - object)
 (:init 
    (arm-empty)
    (clear b125)
    (on b125 b283)
    (on b283 b47)
    (on b47 b205)
    (on-table b205)
    (clear b62)
    (on b62 b91)
    (on b91 b226)
    (on b226 b69)
    (on b69 b20)
    (on b20 b17)
    (on b17 b198)
    (on-table b198)
    (clear b212)
    (on b212 b288)
    (on-table b288)
    (clear b285)
    (on-table b285)
    (clear b293)
    (on-table b293)
    (clear b146)
    (on b146 b80)
    (on b80 b101)
    (on b101 b156)
    (on b156 b256)
    (on b256 b199)
    (on b199 b66)
    (on b66 b84)
    (on-table b84)
    (clear b136)
    (on-table b136)
    (clear b219)
    (on b219 b114)
    (on b114 b88)
    (on-table b88)
    (clear b279)
    (on b279 b274)
    (on b274 b306)
    (on b306 b222)
    (on-table b222)
    (clear b143)
    (on b143 b246)
    (on b246 b248)
    (on b248 b28)
    (on b28 b281)
    (on-table b281)
    (clear b163)
    (on b163 b239)
    (on b239 b140)
    (on-table b140)
    (clear b139)
    (on b139 b247)
    (on b247 b211)
    (on b211 b276)
    (on b276 b4)
    (on b4 b133)
    (on b133 b58)
    (on b58 b94)
    (on-table b94)
    (clear b240)
    (on-table b240)
    (clear b149)
    (on-table b149)
    (clear b105)
    (on b105 b296)
    (on-table b296)
    (clear b71)
    (on b71 b90)
    (on b90 b54)
    (on b54 b79)
    (on b79 b179)
    (on b179 b284)
    (on b284 b231)
    (on b231 b295)
    (on b295 b220)
    (on-table b220)
    (clear b183)
    (on b183 b273)
    (on b273 b312)
    (on b312 b261)
    (on b261 b193)
    (on b193 b102)
    (on b102 b265)
    (on-table b265)
    (clear b263)
    (on b263 b218)
    (on-table b218)
    (clear b64)
    (on-table b64)
    (clear b40)
    (on b40 b2)
    (on-table b2)
    (clear b115)
    (on b115 b204)
    (on b204 b321)
    (on b321 b294)
    (on-table b294)
    (clear b70)
    (on-table b70)
    (clear b182)
    (on b182 b103)
    (on b103 b52)
    (on b52 b138)
    (on-table b138)
    (clear b228)
    (on-table b228)
    (clear b25)
    (on b25 b243)
    (on b243 b162)
    (on b162 b44)
    (on-table b44)
    (clear b168)
    (on b168 b129)
    (on-table b129)
    (clear b8)
    (on b8 b191)
    (on b191 b238)
    (on b238 b181)
    (on b181 b201)
    (on b201 b188)
    (on b188 b194)
    (on b194 b169)
    (on b169 b160)
    (on-table b160)
    (clear b298)
    (on b298 b96)
    (on b96 b250)
    (on-table b250)
    (clear b86)
    (on-table b86)
    (clear b7)
    (on b7 b310)
    (on b310 b166)
    (on b166 b63)
    (on b63 b161)
    (on b161 b308)
    (on b308 b123)
    (on b123 b39)
    (on b39 b31)
    (on b31 b134)
    (on b134 b59)
    (on b59 b203)
    (on b203 b19)
    (on b19 b257)
    (on-table b257)
    (clear b176)
    (on b176 b27)
    (on b27 b38)
    (on-table b38)
    (clear b36)
    (on b36 b165)
    (on b165 b206)
    (on-table b206)
    (clear b180)
    (on-table b180)
    (clear b41)
    (on b41 b303)
    (on b303 b48)
    (on b48 b35)
    (on b35 b135)
    (on b135 b291)
    (on-table b291)
    (clear b82)
    (on b82 b26)
    (on b26 b122)
    (on-table b122)
    (clear b260)
    (on-table b260)
    (clear b32)
    (on-table b32)
    (clear b14)
    (on b14 b266)
    (on-table b266)
    (clear b157)
    (on b157 b9)
    (on-table b9)
    (clear b242)
    (on b242 b264)
    (on-table b264)
    (clear b272)
    (on b272 b267)
    (on b267 b314)
    (on-table b314)
    (clear b245)
    (on b245 b83)
    (on b83 b280)
    (on b280 b77)
    (on b77 b258)
    (on b258 b216)
    (on-table b216)
    (clear b107)
    (on b107 b167)
    (on b167 b214)
    (on b214 b13)
    (on-table b13)
    (clear b98)
    (on b98 b164)
    (on b164 b76)
    (on b76 b221)
    (on b221 b259)
    (on-table b259)
    (clear b23)
    (on-table b23)
    (clear b97)
    (on b97 b24)
    (on-table b24)
    (clear b217)
    (on b217 b75)
    (on b75 b253)
    (on b253 b317)
    (on b317 b215)
    (on b215 b297)
    (on b297 b53)
    (on b53 b67)
    (on b67 b33)
    (on-table b33)
    (clear b158)
    (on b158 b29)
    (on-table b29)
    (clear b21)
    (on b21 b85)
    (on-table b85)
    (clear b320)
    (on b320 b126)
    (on-table b126)
    (clear b237)
    (on-table b237)
    (clear b311)
    (on-table b311)
    (clear b254)
    (on b254 b112)
    (on b112 b104)
    (on-table b104)
    (clear b309)
    (on b309 b12)
    (on b12 b100)
    (on b100 b148)
    (on-table b148)
    (clear b192)
    (on b192 b142)
    (on b142 b61)
    (on b61 b224)
    (on b224 b144)
    (on b144 b236)
    (on b236 b185)
    (on b185 b225)
    (on-table b225)
    (clear b289)
    (on b289 b287)
    (on-table b287)
    (clear b235)
    (on-table b235)
    (clear b57)
    (on-table b57)
    (clear b68)
    (on-table b68)
    (clear b174)
    (on b174 b11)
    (on b11 b315)
    (on b315 b141)
    (on-table b141)
    (clear b278)
    (on b278 b178)
    (on b178 b5)
    (on-table b5)
    (clear b6)
    (on-table b6)
    (clear b120)
    (on-table b120)
    (clear b147)
    (on b147 b232)
    (on b232 b121)
    (on b121 b116)
    (on b116 b304)
    (on-table b304)
    (clear b130)
    (on b130 b93)
    (on b93 b154)
    (on b154 b152)
    (on b152 b251)
    (on b251 b316)
    (on b316 b16)
    (on b16 b305)
    (on-table b305)
    (clear b208)
    (on b208 b262)
    (on b262 b95)
    (on-table b95)
    (clear b34)
    (on b34 b269)
    (on-table b269)
    (clear b249)
    (on b249 b233)
    (on-table b233)
    (clear b50)
    (on-table b50)
    (clear b99)
    (on-table b99)
    (clear b282)
    (on-table b282)
    (clear b271)
    (on b271 b108)
    (on b108 b106)
    (on b106 b119)
    (on b119 b92)
    (on b92 b113)
    (on b113 b172)
    (on b172 b307)
    (on b307 b118)
    (on-table b118)
    (clear b207)
    (on-table b207)
    (clear b227)
    (on b227 b46)
    (on b46 b171)
    (on b171 b132)
    (on b132 b270)
    (on b270 b200)
    (on b200 b318)
    (on-table b318)
    (clear b170)
    (on-table b170)
    (clear b51)
    (on-table b51)
    (clear b299)
    (on b299 b30)
    (on b30 b313)
    (on-table b313)
    (clear b137)
    (on b137 b292)
    (on-table b292)
    (clear b286)
    (on b286 b159)
    (on b159 b117)
    (on b117 b223)
    (on b223 b300)
    (on-table b300)
    (clear b37)
    (on b37 b150)
    (on b150 b175)
    (on b175 b124)
    (on b124 b184)
    (on b184 b18)
    (on b18 b127)
    (on b127 b268)
    (on b268 b55)
    (on b55 b87)
    (on b87 b73)
    (on b73 b229)
    (on b229 b252)
    (on b252 b230)
    (on b230 b209)
    (on b209 b275)
    (on b275 b290)
    (on b290 b301)
    (on b301 b197)
    (on b197 b128)
    (on b128 b42)
    (on b42 b111)
    (on b111 b213)
    (on-table b213)
    (clear b3)
    (on b3 b234)
    (on b234 b43)
    (on b43 b109)
    (on b109 b10)
    (on b10 b110)
    (on b110 b302)
    (on b302 b56)
    (on b56 b210)
    (on-table b210)
    (clear b153)
    (on b153 b1)
    (on b1 b189)
    (on b189 b72)
    (on-table b72)
    (clear b202)
    (on b202 b241)
    (on b241 b177)
    (on b177 b49)
    (on b49 b22)
    (on-table b22)
    (clear b187)
    (on b187 b173)
    (on b173 b60)
    (on b60 b186)
    (on b186 b255)
    (on-table b255)
    (clear b145)
    (on b145 b15)
    (on-table b15)
    (clear b65)
    (on b65 b196)
    (on b196 b89)
    (on-table b89)
    (clear b155)
    (on-table b155)
    (clear b277)
    (on b277 b131)
    (on-table b131)
    (clear b78)
    (on-table b78)
    (clear b81)
    (on b81 b244)
    (on-table b244)
    (clear b190)
    (on b190 b319)
    (on b319 b74)
    (on-table b74)
    (clear b45)
    (on-table b45)
    (clear b195)
    (on-table b195)
    (clear b151)
    (on-table b151))
 (:goal  (and 
    (clear b2)
    (on b2 b6)
    (on-table b6)
    (clear b4)
    (on b4 b3)
    (on-table b3)
    (clear b8)
    (on b8 b5)
    (on b5 b1)
    (on b1 b7)
    (on-table b7)
    (clear b9)
    (on-table b9))))

; plan
1. (unstack b3 b234)
   deleted: (on b3 b234) (clear b3) (arm-empty)
   added: (holding b3) (clear b234)
   goals met: 3 of 13
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 13
3. (unstack b7 b310)
   deleted: (on b7 b310) (clear b7) (arm-empty)
   added: (holding b7) (clear b310)
   goals met: 4 of 13
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 13
5. (unstack b139 b247)
   deleted: (on b139 b247) (clear b139) (arm-empty)
   added: (holding b139) (clear b247)
   goals met: 5 of 13
6. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 5 of 13
7. (unstack b153 b1)
   deleted: (on b153 b1) (clear b153) (arm-empty)
   added: (holding b153) (clear b1)
   goals met: 5 of 13
8. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 5 of 13
9. (unstack b157 b9)
   deleted: (on b157 b9) (clear b157) (arm-empty)
   added: (holding b157) (clear b9)
   goals met: 6 of 13
10. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 6 of 13
11. (unstack b247 b211)
   deleted: (on b247 b211) (clear b247) (arm-empty)
   added: (holding b247) (clear b211)
   goals met: 6 of 13
12. (putdown b247)
   deleted: (holding b247)
   added: (clear b247) (arm-empty) (on-table b247)
   goals met: 6 of 13
13. (unstack b211 b276)
   deleted: (on b211 b276) (clear b211) (arm-empty)
   added: (holding b211) (clear b276)
   goals met: 6 of 13
14. (putdown b211)
   deleted: (holding b211)
   added: (clear b211) (arm-empty) (on-table b211)
   goals met: 6 of 13
15. (unstack b276 b4)
   deleted: (on b276 b4) (clear b276) (arm-empty)
   added: (holding b276) (clear b4)
   goals met: 7 of 13
16. (putdown b276)
   deleted: (holding b276)
   added: (clear b276) (arm-empty) (on-table b276)
   goals met: 7 of 13
17. (unstack b278 b178)
   deleted: (on b278 b178) (clear b278) (arm-empty)
   added: (holding b278) (clear b178)
   goals met: 7 of 13
18. (putdown b278)
   deleted: (holding b278)
   added: (clear b278) (arm-empty) (on-table b278)
   goals met: 7 of 13
19. (unstack b178 b5)
   deleted: (on b178 b5) (clear b178) (arm-empty)
   added: (holding b178) (clear b5)
   goals met: 7 of 13
20. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 7 of 13
21. (unstack b40 b2)
   deleted: (on b40 b2) (clear b40) (arm-empty)
   added: (holding b40) (clear b2)
   goals met: 8 of 13
22. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 8 of 13
23. (unstack b1 b189)
   deleted: (on b1 b189) (clear b1) (arm-empty)
   added: (holding b1) (clear b189)
   goals met: 8 of 13
24. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 9 of 13
25. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 13
26. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 10 of 13
27. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 13
28. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 11 of 13
29. (unstack b4 b133)
   deleted: (on b4 b133) (clear b4) (arm-empty)
   added: (holding b4) (clear b133)
   goals met: 10 of 13
30. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 12 of 13
31. (unstack b8 b191)
   deleted: (on b8 b191) (clear b8) (arm-empty)
   added: (holding b8) (clear b191)
   goals met: 11 of 13
32. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 13 of 13
